Repository: mohsinalimat/Vocabulary-Learning-App
Catalog: VocabularyLearningApp/VocabularyLearningApp/VocabularyLearningApp/*.lproj/Localizable.strings
Languages: tr

# ADD_WORD_TITLE
source: Add Word
tr: Kelime Ekle

# WORD_TEXTFILED_PLACEHOLDER
source: Enter the word to add
tr: Eklenecek Kelimeyi Girin

# WORD_TRANSLATE_TEXTFILED_PLACEHOLDER
source: Enter Turkish translation of word
tr: Kelimenin Türkçesini Girin

# WORD_DESC_TEXTVIEW_PLACEHOLDER
source: Enter a Sentence with a Word
tr: Kelimeyi İçeren Bir Cümle Girin

# ADD_BUTTON
source: ADD
tr: EKLE

# EMPTY_ALERT_TITLE
source: Alert
tr: Uyarı

# EMPTY_ALERT_MESSAGE
source: Please do not leave the required fields empty.
tr: Lütfen gerekli alanları boş bırakmayın.

# OKAY
source: Ok
tr: Tamam

# CATEGORY_BUTTON
source: Select Category
tr: Kategori Seçin

# FIREBASE_SUCCES_TITLE
source: INFO
tr: BİLGİ

# FIREBASE_SUCCES
source: Word successfully added, thank you.
tr: Kelime başarılı şekilde eklendi, teşekkür ederim.

# FIREBASE_ALERT_TITLE
source: Alert
tr: UYARI

# A_ISSUE
source: Something went wrong
tr: Bir hata oluştu

source: Please wait
tr: Lütfen Bekleyin

# INFO_TITLE
source: Info
tr: Bilgi

# WORD_INFO
source: If you are not sure of the type of your word, you can enter it according to the following information. n n • Name: The words that meet the living and non-living beings, feelings and thoughts, situations. n • Adjective (Pread): These are the words of the names, the number, the size of the names, the words, the asking or the stating. n • Verb (Action): These are words that appear, make things happen. n • Pronouns: The words that bear the names of the names, the person carrying out the task, the question, the show and the words that carry the concepts of apathy. n • Envelope (Adverb): These are words that refer to their characteristics, time, direction, and quantity, from verbs, adjectives, or envelopes. these are the words that connect in terms of meaning and form.
tr: Kelimenizin Türünden emin değilseniz aşağıdaki bilgilere göre girebilirsiniz. • İsim (Ad): Canlı ve cansız varlıkları, duygu ve düşünceleri, durumları karşılayan sözcüklerdir. • Sıfat (Önad): Adların niteliklerini, ne durumda olduklarını sayılarını, ölçülerini, gösteren, soran ya da belirten sözcüklerdir. • Fiil (Eylem): Oluş, kılınış, durum gösteren sözcüklerdir. • Zamir (Adıl): Adların yerini tutan, bu görevi yerine getirirken kişi, soru, gösterme ve belgisizlik kavramları da taşıyan sözcüklerdir. • Zarf (Belirteç): Fiillerden, sıfatlardan veya zarflardan önce gelerek onların özelliklerini, zamanını, yönünü, miktarını belirten sözcüklerdir. • Bağlaç: Eş görevli ya da birbiriyle ilgili sözcükleri, sözcük öbeklerini, özellikle cümleleri bağlamaya yarayan; bunlar arasında anlam ve biçim bakımından bağlantı kuran sözcüklerdir.

# USER_PASSWORD
source: Password
tr: Şifre

source: Please write something
tr: Gerekli yerleri doldurmanız gerekmektedir.

# USER_EMAIL
source: E-Mail
tr: E-Posta

# SPLASH_BOARD_TITLE
source: Welcome
tr: Hoşgeldiniz

# SPLASH_BOARD_DESC
source: Log in to make better use of the application n Your learning data is recorded and the test is created from the words you learned.
tr: Uygulamadan daha iyi yararlanabilmek için giriş yapın Öğrenme verileriniz kaydedilip öğrendiğiniz kelimelerden test oluşturulur.

# SPLASH_BOARD_SIGNIN
source: Sign in
tr: Giriş Yap

# SPLASH_BOARD_SIGNUP
source: Sign up
tr: Kaydol

source: Sign in
tr: Giriş Yap

# SIGNIN_DESC
source: You can log in by entering your username and password
tr: Kullanıcı adınız ve şifrenizi girerek giriş yapabilirsiniz

# SIGNUP_DESC
source: Please enter your details to sign up
tr: Kaydolmak için lütfen bilgilerinizi girin

source: Sign up
tr: Kaydol

# ACCOUNT_BOARD_TITLE
source: Account
tr: Hesap

# ACCOUNT_BOARD_DESC
source: You can log out of your account or delete the learning data for your account.
tr: Hesabınızdan çıkış yapabilir ya da hesabınıza ait öğrenme verilerini silebilirsiniz.

# ACCOUNT_BOARD_LOG_OUT
source: Log out
tr: Çıkış Yap

# ACCOUNT_BOARD_DELETE_DATA
source: Delete all my data
tr: Tüm verilerimi sil

# ARE_YOU_SURE
source: If you are sure, click
tr: Eminseniz tıklayın

# DELETE_ACCOUNT_QUESTION
source: This will delete data held by your account. All of your progress history and test words will be deleted and this operation will NOT return.
tr: Bu işlem hesabınıza ait tutulan verileri silecektir. Tüm ilerleme geçmişiniz ve test kelimeleriniz silinecektir ve bu işlem GERİ ALINAMAZ.

# LEARN_VC_TITLE
source: Learn
tr: Öğren

# TEST_VC_TITLE
source: Test
tr: Test Et

# ALERT_TITLE
source: Warning
tr: Uyarı

source: Congratulations
tr: Tebrikler

# COMPLETED_WORDS
source: You learned a word more completely.
tr: Bir kelimeyi daha tamamen öğrendiniz.

# LEVEL_INFO
source: Learning Level
tr: Öğrenme Seviyesi

# LEVEL_INFO_DESC
source: It is a measure of the level at which you learn a word. If you answer a word that has reached the fourth level correctly, you are now fully learned. nIf you answer any word incorrectly, it will be lit as level 1.
tr: Bir kelimeyi hangi seviyede öğrendiğinizin ölçüsüdür. Dördüncü seviyeye ulaşmış bir kelimeyi doğru cevaplarsanız artık tamamen öğrenmişsiniz demektir. Herhangi bir kelimeyi hatalı cevaplarsanız ise seviye 1 olarak yanilenir.

# CHART_VC_TITLE
source: Statistics
tr: İstatistikler

# ERROR_FETCH_CHART
source: There was a problem getting statistics.
tr: İstatistikler alınırken bir sorun oluştu

# SELECT_MENU
source: Range of Statistics
tr: İstatistiğin Aralığını

# SELECT_MENU_DESC
source: Specify the range of data to be fetched for the chart.
tr: Grafik için getirilecek verilerin aralığını belirleyin.

# SELECT_DAY
source: The last day
tr: Son gün

# SELECT_WEEK
source: Last week
tr: Son bir hafta

# SELECT_MONTH
source: Last month
tr: Son bir ay

# SELECT_SIX_MONTH
source: Last six months
tr: Son altı ay

# SELECT_YEAR
source: Last year
tr: Son bir yıl

source: Cancel
tr: İptal

# NO_CHART_DATA
source: No data to display
tr: Gösterilecek veri bulunamadı

# NULL_TEST_WORDS
source: No data to be tested, please learn from the Learn page and then test what you have learned here.
tr: Test edilecek veri bulunamadı, lütfen öğren sayfasından kelime öğrenin ardından buradan öğrendiklerinizi test edin.

source: Word Not Found
tr: Kelime Bulunamadı

# TEST_DATA_ERROR
source: Error in test data
tr: Test verilerinde hata

# FAIL_FETCHWORD
source: There was an error retrieving words from the server
tr: Kelimeler sunucudan alınırken bir hata oluştu

# EMPTY_LEARN_WORD
source: There are no new words to learn, you can contribute by adding words.
tr: Öğrenilebilecek yeni kelime kalmadı, kelime ekleyrek katkıda bulunabilirsiniz.

# EMPTY_TEST_WORD
source: There's no left word to test. You can learn and test new words, or come back later and test the words that come in the day.
tr: Test edilecek kelime kalmadı. Yeni kelimeler öğrenip test edebilir ya da daha sonra gelerek günü gelen kelimeleri test edebilirsiniz.

# NOT_SIGNIN
source: Not logged in
tr: Giriş Yapılmamış

# PLEASE_SIGNIN
source: To add words, you need to login to the application.
tr: Kelime eklemek için uygulamaya giriş yapmanız gerekmektedir.

# PLEASE_SIGNIN_FOR_DELETE_DATA
source: Please login to delete your data.
tr: Verilerinizi silmek için lütfen giriş yapınız.

# PLEASE_SIGNIN_FOR_TEST
source: You must log in to create your test data.
tr: Test verilerinizin oluşması için giriş yapmalısınız.

# PLEASE_SIGNIN_FOR_CHART
source: You must be logged in to view your stats.
tr: İstatistiklerinizi görebilmek için giriş yapmalısınız.
